mcgreg1/Tonuino-ESP32-I2S/src/main.cpp
    for (;;) {
        esp_task_wdt_reset();
        vTaskDelay(10);
        if ((millis() - lastRfidCheckTimestamp) >= 100) 
        {
            lastRfidCheckTimestamp = millis();
            // Reset the loop if no new card is present on the sensor/reader. This saves the entire process when idle.
            //here the loop
            byte pollResult = pollCard(mfrc522);
            if (pollResult)
            {
                dump_byte_array(cardId, 4);
            }
            if (playProperties.playMode == NO_PLAYLIST)
            {
                if (pollResult==PCS_CARD_IS_BACK)
                {
                    //if there is no playlist, and a card has been place, handle it as NEW CARD
                    Serial.println("Handling as new card, because no playlist");//TODO: MODIFIER
                    pollResult=PCS_NEW_CARD;

                }

            }

            if (pollResult==PCS_CARD_GONE)
            {
                trackControlToQueueSender(PAUSE);
            }
            else if (pollResult==PCS_CARD_IS_BACK)
            {
                trackControlToQueueSender(RESUME);
            }
            else if (pollResult==PCS_NEW_CARD)
            {
                
              
                xQueueSend(rfidCardQueue, cardId, 0);
            }

        }
    }
    vTaskDelete(NULL);
}





byte pollCard(MFRC522 mfrc522)
{
    //byte cardId[cardIdSize];
  rfid_tag_present_prev = rfid_tag_present;

  _rfid_error_counter ++;
  if (_rfid_error_counter > 5) 
  {
    _tag_found = false;
  }

  // Detect Tag without looking for collisions
  byte bufferATQA[2];
  byte bufferSize = sizeof(bufferATQA);

  // Reset baud rates
  mfrc522.PCD_WriteRegister(mfrc522.TxModeReg, 0x00);
  mfrc522.PCD_WriteRegister(mfrc522.RxModeReg, 0x00);
  // Reset ModWidthReg
  mfrc522.PCD_WriteRegister(mfrc522.ModWidthReg, 0x26);

  MFRC522::StatusCode result = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);

  if (result == mfrc522.STATUS_OK) 
  {
    if ( ! mfrc522.PICC_ReadCardSerial()) 
    { //Since a PICC placed get Serial and continue
      _rfid_error_counter++;
      Serial.println((String)"Error received RFID: " +_rfid_error_counter);
      return PCS_READ_ERROR;
    }
    _rfid_error_counter = 0;
    _tag_found = true;
  }

  rfid_tag_present = _tag_found;
  // rising edge: card placed
  if (rfid_tag_present && !rfid_tag_present_prev) 
  {

    if (!memcmp(cardId, mfrc522.uid.uidByte, cardIdSize)) //same UUID
    {
      return PCS_CARD_IS_BACK; //no change
    }
    else 
    {
      memcpy(cardId, mfrc522.uid.uidByte, cardIdSize);
      return PCS_NEW_CARD; //new card    
    }  
  }
  // falling edge: card removed
  else if (!rfid_tag_present && rfid_tag_present_prev)
  {
      /*
      cardId[0]=0;
      cardId[1]=0;
      cardId[2]=0;
      cardId[3]=0;
        */
    return PCS_CARD_GONE;
  } 
    
    
  else //present = previous
    return PCS_NO_CHANGE; //no Change
}

void dump_byte_array(byte * buffer, byte bufferSize) {
  for (byte i = 0; i < bufferSize; i++) {
    Serial.print(buffer[i] < 0x10 ? " 0" : " ");
    Serial.print(buffer[i], HEX);
  }
  Serial.println();
}

// This task handles everything for Neopixel-visualisation
#ifdef NEOPIXEL_ENABLE
void showLed(void *parameter) {
    static uint8_t hlastVolume = currentVolume;
    static uint8_t lastPos = playProperties.currentRelPos;
    static bool lastPlayState = false;
    static bool lastLockState = false;
    static bool ledBusyShown = false;
    static bool notificationShown = false;
    static bool volumeChangeShown = false;
    static uint8_t ledPosWebstream = 0;
    static uint8_t ledSwitchInterval = 5; // time in secs (webstream-only)
    static uint8_t webstreamColor = 0;
    static unsigned long lastSwitchTimestamp = 0;
    static bool redrawProgress = false;
    static uint8_t lastLedBrightness = ledBrightness;

    static CRGB leds[NUM_LEDS];
    FastLED.addLeds<CHIPSET , LED_PIN, COLOR_ORDER>(leds, NUM_LEDS).setCorrection( TypicalSMD5050 );
    FastLED.setBrightness(ledBrightness);

    for (;;) {
        if (!bootComplete) {
            FastLED.clear();
            FastLED.show();
            vTaskDelay(portTICK_RATE_MS*100);
            esp_task_wdt_reset();
            continue;
        }
        if (lastLedBrightness != ledBrightness) {
            FastLED.setBrightness(ledBrightness);
            lastLedBrightness = ledBrightness;
        }

        if (!buttons[3].currentState) {
            FastLED.clear();
            for(uint8_t led = 0; led < NUM_LEDS; led++) {
                leds[led] = CRGB::Red;
                if (buttons[3].currentState) {
                    FastLED.clear();
                    FastLED.show();
                    delay(5);
                    deepSleepManager();
                    break;
                }
                FastLED.show();
                vTaskDelay(intervalToLongPress / NUM_LEDS * portTICK_RATE_MS);
            }
        }

        if (showLedError) {             // If error occured (e.g. RFID-modification not accepted)
            showLedError = false;
            notificationShown = true;
            FastLED.clear();

            for(uint8_t led = 0; led < NUM_LEDS; led++) {
                leds[led] = CRGB::Red;
            }
            FastLED.show();
            vTaskDelay(portTICK_RATE_MS * 200);
        }

        if (showLedOk) {             // If action was accepted
            showLedOk = false;
            notificationShown = true;
            FastLED.clear();

            for(uint8_t led = 0; led < NUM_LEDS; led++) {
                leds[led] = CRGB::Green;
            }
            FastLED.show();
            vTaskDelay(portTICK_RATE_MS * 400);
        }

        if (hlastVolume != currentVolume) {         // If volume has been changed
            uint8_t numLedsToLight = map(currentVolume, 0, maxVolume, 0, NUM_LEDS);
            hlastVolume = currentVolume;
            volumeChangeShown = true;
            FastLED.clear();

            for(int led = 0; led < numLedsToLight; led++) {     // (Inverse) color-gradient from green (85) back to (still) red (245) using unsigned-cast
                leds[led].setHue((uint8_t) (85 - ((double) 95 / NUM_LEDS) * led));
            }
            FastLED.show();

            for (uint8_t i=0; i<=50; i++) {
                if (hlastVolume != currentVolume || showLedError || showLedOk || !buttons[3].currentState) {
                    if (hlastVolume != currentVolume) {
                        volumeChangeShown = false;
                    }
                    break;
                }

                vTaskDelay(portTICK_RATE_MS*20);
            }
        }

        if (showRewind) {
            showRewind = false;
            for (uint8_t i=NUM_LEDS-1; i>0; i--) {
                leds[i] = CRGB::Black;
                FastLED.show();
                if (hlastVolume != currentVolume || lastLedBrightness != ledBrightness || showLedError || showLedOk || !buttons[3].currentState) {
                    break;
                } else {
                    vTaskDelay(portTICK_RATE_MS*30);
                }
            }
        }

        if (showPlaylistProgress) {
            showPlaylistProgress = false;
            if (playProperties.numberOfTracks > 1 && playProperties.currentTrackNumber < playProperties.numberOfTracks) {
                uint8_t numLedsToLight = map(playProperties.currentTrackNumber, 0, playProperties.numberOfTracks-1, 0, NUM_LEDS);
                FastLED.clear();
                for (uint8_t i=0; i < numLedsToLight; i++) {
                    leds[i] = CRGB::Blue;
                    FastLED.show();
                    if (hlastVolume != currentVolume || lastLedBrightness != ledBrightness || showLedError || showLedOk || !buttons[3].currentState) {
                        break;
                    } else {
                        vTaskDelay(portTICK_RATE_MS*30);
                    }
                }

                for (uint8_t i=0; i<=100; i++) {
                   if (hlastVolume != currentVolume || lastLedBrightness != ledBrightness || showLedError || showLedOk || !buttons[3].currentState) {
                        break;
                    } else {
                        vTaskDelay(portTICK_RATE_MS*15);
                    }
                }

                for (uint8_t i=numLedsToLight; i>0; i--) {
                    leds[i-1] = CRGB::Black;
                    FastLED.show();
                    if (hlastVolume != currentVolume || lastLedBrightness != ledBrightness || showLedError || showLedOk || !buttons[3].currentState) {
                        break;
                    } else {
                        vTaskDelay(portTICK_RATE_MS*30);
                    }
                }
            }
        }

        switch (playProperties.playMode) {
            case NO_PLAYLIST:                   // If no playlist is active (idle)
                if (hlastVolume == currentVolume && lastLedBrightness == ledBrightness) {
                    for (uint8_t i=0; i < NUM_LEDS; i++) {
                        FastLED.clear();
                        if (i == 0) {
                            leds[0] = CRGB::White;
                            leds[NUM_LEDS/4] = CRGB::White;
                            leds[NUM_LEDS/2] = CRGB::White;
                            leds[NUM_LEDS/4*3] = CRGB::White;
                        } else {
                            leds[i % NUM_LEDS] = CRGB::White;
                            leds[(i+NUM_LEDS/4) % NUM_LEDS] = CRGB::White;
                            leds[(i+NUM_LEDS/2) % NUM_LEDS] = CRGB::White;
                            leds[(i+NUM_LEDS/4*3) % NUM_LEDS] = CRGB::White;
                        }
                        FastLED.show();
                        for (uint8_t i=0; i<=50; i++) {
                            if (hlastVolume != currentVolume || lastLedBrightness != ledBrightness || showLedError || showLedOk || playProperties.playMode != NO_PLAYLIST || !buttons[3].currentState) {
                                break;
                            } else {
                                vTaskDelay(portTICK_RATE_MS * 10);
                            }
                        }
                    }
                }
                break;

